src_doc/ExchangePlans/ИнтегрированныеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ExchangePlan>
		<Properties>
			<Name>ИнтегрированныеСистемы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресВебСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресХостаВнешнихНавигационныхСсылок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоддерживаетПравилаЗагрузкиДанныхВДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СопоставлятьСотрудниковПоДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СопоставлятьСотрудниковПоПодразделению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасположенияХостаВнешнихНавигационныхСсылок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасположенияИнформационнойБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелДляСинхронизацииДанных</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

src_doc/ExchangePlans/ИнтегрированныеСистемы/Forms/ФормаУзла/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписьИнтегрированнойСистемы");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресВебСервисаПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоддерживаетПравилаЗагрузкиДанныхВДОПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АдресХостаВнешнихНавигационныхСсылок(Команда)
	
	ДанныеУзла = ДанныеУзла();
	ОповещениеОЗакрытии = Новый ОписаниеОповещения(
		"АдресХостаВнешнихНавигационныхСсылокПриИзменении",
		ЭтотОбъект,
		ДанныеУзла);
	ОткрытьФорму(
		"ПланОбмена.ИнтегрированныеСистемы.Форма.АдресХостаВнешнихНавигационныхСсылок",
		ДанныеУзла,,,,,
		ОповещениеОЗакрытии);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура АдресХостаВнешнихНавигационныхСсылокПриИзменении(Результат, ДанныеУзла) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.АдресХостаВнешнихНавигационныхСсылок = Результат.АдресХостаВнешнихНавигационныхСсылок;
	Объект.ТипРасположенияХостаВнешнихНавигационныхСсылок = Результат.ТипРасположенияХостаВнешнихНавигационныхСсылок;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ДанныеУзла()
	
	ДанныеУзла = Новый Структура;
	ДанныеУзла.Вставить("Наименование", Объект.Наименование);
	ДанныеУзла.Вставить("АдресВебСервиса", Объект.АдресВебСервиса);
	ДанныеУзла.Вставить("АдресХостаВнешнихНавигационныхСсылок", Объект.АдресХостаВнешнихНавигационныхСсылок);
	ДанныеУзла.Вставить("ТипРасположенияХостаВнешнихНавигационныхСсылок", Объект.ТипРасположенияХостаВнешнихНавигационныхСсылок);
	
	Возврат ДанныеУзла;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.АдресХостаВнешнихНавигационныхСсылок.Видимость = Объект.ПоддерживаетПравилаЗагрузкиДанныхВДО
		И ЗначениеЗаполнено(Объект.АдресВебСервиса);
	
КонецПроцедуры

#КонецОбласти
